Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/nmic.h
/*
 * Component description for NMIC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-03-27T04:07:22Z */
#ifndef _SAMRH707_NMIC_COMPONENT_H_
#define _SAMRH707_NMIC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR NMIC                                         */
/* ************************************************************************** */

/* -------- NMIC_IER : (NMIC Offset: 0x00) ( /W 32) Interrupt Enable Register -------- */
#define NMIC_IER_NMI0_Pos                     _UINT32_(0)                                          /* (NMIC_IER) Non-maskable Interrupt 0 Enable Position */
#define NMIC_IER_NMI0_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI0_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 0 Enable Mask */
#define NMIC_IER_NMI0(value)                  (NMIC_IER_NMI0_Msk & (_UINT32_(value) << NMIC_IER_NMI0_Pos)) /* Assigment of value for NMI0 in the NMIC_IER register */
#define NMIC_IER_NMI1_Pos                     _UINT32_(1)                                          /* (NMIC_IER) Non-maskable Interrupt 1 Enable Position */
#define NMIC_IER_NMI1_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI1_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 1 Enable Mask */
#define NMIC_IER_NMI1(value)                  (NMIC_IER_NMI1_Msk & (_UINT32_(value) << NMIC_IER_NMI1_Pos)) /* Assigment of value for NMI1 in the NMIC_IER register */
#define NMIC_IER_NMI2_Pos                     _UINT32_(2)                                          /* (NMIC_IER) Non-maskable Interrupt 2 Enable Position */
#define NMIC_IER_NMI2_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI2_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 2 Enable Mask */
#define NMIC_IER_NMI2(value)                  (NMIC_IER_NMI2_Msk & (_UINT32_(value) << NMIC_IER_NMI2_Pos)) /* Assigment of value for NMI2 in the NMIC_IER register */
#define NMIC_IER_NMI3_Pos                     _UINT32_(3)                                          /* (NMIC_IER) Non-maskable Interrupt 3 Enable Position */
#define NMIC_IER_NMI3_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI3_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 3 Enable Mask */
#define NMIC_IER_NMI3(value)                  (NMIC_IER_NMI3_Msk & (_UINT32_(value) << NMIC_IER_NMI3_Pos)) /* Assigment of value for NMI3 in the NMIC_IER register */
#define NMIC_IER_NMI4_Pos                     _UINT32_(4)                                          /* (NMIC_IER) Non-maskable Interrupt 4 Enable Position */
#define NMIC_IER_NMI4_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI4_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 4 Enable Mask */
#define NMIC_IER_NMI4(value)                  (NMIC_IER_NMI4_Msk & (_UINT32_(value) << NMIC_IER_NMI4_Pos)) /* Assigment of value for NMI4 in the NMIC_IER register */
#define NMIC_IER_NMI5_Pos                     _UINT32_(5)                                          /* (NMIC_IER) Non-maskable Interrupt 5 Enable Position */
#define NMIC_IER_NMI5_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI5_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 5 Enable Mask */
#define NMIC_IER_NMI5(value)                  (NMIC_IER_NMI5_Msk & (_UINT32_(value) << NMIC_IER_NMI5_Pos)) /* Assigment of value for NMI5 in the NMIC_IER register */
#define NMIC_IER_NMI6_Pos                     _UINT32_(6)                                          /* (NMIC_IER) Non-maskable Interrupt 6 Enable Position */
#define NMIC_IER_NMI6_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI6_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 6 Enable Mask */
#define NMIC_IER_NMI6(value)                  (NMIC_IER_NMI6_Msk & (_UINT32_(value) << NMIC_IER_NMI6_Pos)) /* Assigment of value for NMI6 in the NMIC_IER register */
#define NMIC_IER_NMI7_Pos                     _UINT32_(7)                                          /* (NMIC_IER) Non-maskable Interrupt 7 Enable Position */
#define NMIC_IER_NMI7_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI7_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 7 Enable Mask */
#define NMIC_IER_NMI7(value)                  (NMIC_IER_NMI7_Msk & (_UINT32_(value) << NMIC_IER_NMI7_Pos)) /* Assigment of value for NMI7 in the NMIC_IER register */
#define NMIC_IER_NMI8_Pos                     _UINT32_(8)                                          /* (NMIC_IER) Non-maskable Interrupt 8 Enable Position */
#define NMIC_IER_NMI8_Msk                     (_UINT32_(0x1) << NMIC_IER_NMI8_Pos)                 /* (NMIC_IER) Non-maskable Interrupt 8 Enable Mask */
#define NMIC_IER_NMI8(value)                  (NMIC_IER_NMI8_Msk & (_UINT32_(value) << NMIC_IER_NMI8_Pos)) /* Assigment of value for NMI8 in the NMIC_IER register */
#define NMIC_IER_Msk                          _UINT32_(0x000001FF)                                 /* (NMIC_IER) Register Mask  */

#define NMIC_IER_NMI_Pos                      _UINT32_(0)                                          /* (NMIC_IER Position) Non-maskable Interrupt 8 Enable */
#define NMIC_IER_NMI_Msk                      (_UINT32_(0x1FF) << NMIC_IER_NMI_Pos)                /* (NMIC_IER Mask) NMI */
#define NMIC_IER_NMI(value)                   (NMIC_IER_NMI_Msk & (_UINT32_(value) << NMIC_IER_NMI_Pos)) 

