Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/nmic.h
/* -------- NMIC_IDR : (NMIC Offset: 0x04) ( /W 32) Interrupt Disable Register -------- */
#define NMIC_IDR_NMI0_Pos                     _UINT32_(0)                                          /* (NMIC_IDR) Non-maskable Interrupt 0 Disable Position */
#define NMIC_IDR_NMI0_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI0_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 0 Disable Mask */
#define NMIC_IDR_NMI0(value)                  (NMIC_IDR_NMI0_Msk & (_UINT32_(value) << NMIC_IDR_NMI0_Pos)) /* Assigment of value for NMI0 in the NMIC_IDR register */
#define NMIC_IDR_NMI1_Pos                     _UINT32_(1)                                          /* (NMIC_IDR) Non-maskable Interrupt 1 Disable Position */
#define NMIC_IDR_NMI1_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI1_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 1 Disable Mask */
#define NMIC_IDR_NMI1(value)                  (NMIC_IDR_NMI1_Msk & (_UINT32_(value) << NMIC_IDR_NMI1_Pos)) /* Assigment of value for NMI1 in the NMIC_IDR register */
#define NMIC_IDR_NMI2_Pos                     _UINT32_(2)                                          /* (NMIC_IDR) Non-maskable Interrupt 2 Disable Position */
#define NMIC_IDR_NMI2_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI2_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 2 Disable Mask */
#define NMIC_IDR_NMI2(value)                  (NMIC_IDR_NMI2_Msk & (_UINT32_(value) << NMIC_IDR_NMI2_Pos)) /* Assigment of value for NMI2 in the NMIC_IDR register */
#define NMIC_IDR_NMI3_Pos                     _UINT32_(3)                                          /* (NMIC_IDR) Non-maskable Interrupt 3 Disable Position */
#define NMIC_IDR_NMI3_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI3_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 3 Disable Mask */
#define NMIC_IDR_NMI3(value)                  (NMIC_IDR_NMI3_Msk & (_UINT32_(value) << NMIC_IDR_NMI3_Pos)) /* Assigment of value for NMI3 in the NMIC_IDR register */
#define NMIC_IDR_NMI4_Pos                     _UINT32_(4)                                          /* (NMIC_IDR) Non-maskable Interrupt 4 Disable Position */
#define NMIC_IDR_NMI4_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI4_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 4 Disable Mask */
#define NMIC_IDR_NMI4(value)                  (NMIC_IDR_NMI4_Msk & (_UINT32_(value) << NMIC_IDR_NMI4_Pos)) /* Assigment of value for NMI4 in the NMIC_IDR register */
#define NMIC_IDR_NMI5_Pos                     _UINT32_(5)                                          /* (NMIC_IDR) Non-maskable Interrupt 5 Disable Position */
#define NMIC_IDR_NMI5_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI5_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 5 Disable Mask */
#define NMIC_IDR_NMI5(value)                  (NMIC_IDR_NMI5_Msk & (_UINT32_(value) << NMIC_IDR_NMI5_Pos)) /* Assigment of value for NMI5 in the NMIC_IDR register */
#define NMIC_IDR_NMI6_Pos                     _UINT32_(6)                                          /* (NMIC_IDR) Non-maskable Interrupt 6 Disable Position */
#define NMIC_IDR_NMI6_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI6_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 6 Disable Mask */
#define NMIC_IDR_NMI6(value)                  (NMIC_IDR_NMI6_Msk & (_UINT32_(value) << NMIC_IDR_NMI6_Pos)) /* Assigment of value for NMI6 in the NMIC_IDR register */
#define NMIC_IDR_NMI7_Pos                     _UINT32_(7)                                          /* (NMIC_IDR) Non-maskable Interrupt 7 Disable Position */
#define NMIC_IDR_NMI7_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI7_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 7 Disable Mask */
#define NMIC_IDR_NMI7(value)                  (NMIC_IDR_NMI7_Msk & (_UINT32_(value) << NMIC_IDR_NMI7_Pos)) /* Assigment of value for NMI7 in the NMIC_IDR register */
#define NMIC_IDR_NMI8_Pos                     _UINT32_(8)                                          /* (NMIC_IDR) Non-maskable Interrupt 8 Disable Position */
#define NMIC_IDR_NMI8_Msk                     (_UINT32_(0x1) << NMIC_IDR_NMI8_Pos)                 /* (NMIC_IDR) Non-maskable Interrupt 8 Disable Mask */
#define NMIC_IDR_NMI8(value)                  (NMIC_IDR_NMI8_Msk & (_UINT32_(value) << NMIC_IDR_NMI8_Pos)) /* Assigment of value for NMI8 in the NMIC_IDR register */
#define NMIC_IDR_Msk                          _UINT32_(0x000001FF)                                 /* (NMIC_IDR) Register Mask  */

#define NMIC_IDR_NMI_Pos                      _UINT32_(0)                                          /* (NMIC_IDR Position) Non-maskable Interrupt 8 Disable */
#define NMIC_IDR_NMI_Msk                      (_UINT32_(0x1FF) << NMIC_IDR_NMI_Pos)                /* (NMIC_IDR Mask) NMI */
#define NMIC_IDR_NMI(value)                   (NMIC_IDR_NMI_Msk & (_UINT32_(value) << NMIC_IDR_NMI_Pos)) 

/* -------- NMIC_IAR : (NMIC Offset: 0x08) ( R/ 32) Interrupt Active Register -------- */
#define NMIC_IAR_NMI0_Pos                     _UINT32_(0)                                          /* (NMIC_IAR) Active Interrupt 0 Position */
#define NMIC_IAR_NMI0_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI0_Pos)                 /* (NMIC_IAR) Active Interrupt 0 Mask */
#define NMIC_IAR_NMI0(value)                  (NMIC_IAR_NMI0_Msk & (_UINT32_(value) << NMIC_IAR_NMI0_Pos)) /* Assigment of value for NMI0 in the NMIC_IAR register */
#define NMIC_IAR_NMI1_Pos                     _UINT32_(1)                                          /* (NMIC_IAR) Active Interrupt 1 Position */
#define NMIC_IAR_NMI1_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI1_Pos)                 /* (NMIC_IAR) Active Interrupt 1 Mask */
#define NMIC_IAR_NMI1(value)                  (NMIC_IAR_NMI1_Msk & (_UINT32_(value) << NMIC_IAR_NMI1_Pos)) /* Assigment of value for NMI1 in the NMIC_IAR register */
#define NMIC_IAR_NMI2_Pos                     _UINT32_(2)                                          /* (NMIC_IAR) Active Interrupt 2 Position */
#define NMIC_IAR_NMI2_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI2_Pos)                 /* (NMIC_IAR) Active Interrupt 2 Mask */
#define NMIC_IAR_NMI2(value)                  (NMIC_IAR_NMI2_Msk & (_UINT32_(value) << NMIC_IAR_NMI2_Pos)) /* Assigment of value for NMI2 in the NMIC_IAR register */
#define NMIC_IAR_NMI3_Pos                     _UINT32_(3)                                          /* (NMIC_IAR) Active Interrupt 3 Position */
#define NMIC_IAR_NMI3_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI3_Pos)                 /* (NMIC_IAR) Active Interrupt 3 Mask */
#define NMIC_IAR_NMI3(value)                  (NMIC_IAR_NMI3_Msk & (_UINT32_(value) << NMIC_IAR_NMI3_Pos)) /* Assigment of value for NMI3 in the NMIC_IAR register */
#define NMIC_IAR_NMI4_Pos                     _UINT32_(4)                                          /* (NMIC_IAR) Active Interrupt 4 Position */
#define NMIC_IAR_NMI4_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI4_Pos)                 /* (NMIC_IAR) Active Interrupt 4 Mask */
#define NMIC_IAR_NMI4(value)                  (NMIC_IAR_NMI4_Msk & (_UINT32_(value) << NMIC_IAR_NMI4_Pos)) /* Assigment of value for NMI4 in the NMIC_IAR register */
#define NMIC_IAR_NMI5_Pos                     _UINT32_(5)                                          /* (NMIC_IAR) Active Interrupt 5 Position */
#define NMIC_IAR_NMI5_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI5_Pos)                 /* (NMIC_IAR) Active Interrupt 5 Mask */
#define NMIC_IAR_NMI5(value)                  (NMIC_IAR_NMI5_Msk & (_UINT32_(value) << NMIC_IAR_NMI5_Pos)) /* Assigment of value for NMI5 in the NMIC_IAR register */
#define NMIC_IAR_NMI6_Pos                     _UINT32_(6)                                          /* (NMIC_IAR) Active Interrupt 6 Position */
#define NMIC_IAR_NMI6_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI6_Pos)                 /* (NMIC_IAR) Active Interrupt 6 Mask */
#define NMIC_IAR_NMI6(value)                  (NMIC_IAR_NMI6_Msk & (_UINT32_(value) << NMIC_IAR_NMI6_Pos)) /* Assigment of value for NMI6 in the NMIC_IAR register */
#define NMIC_IAR_NMI7_Pos                     _UINT32_(7)                                          /* (NMIC_IAR) Active Interrupt 7 Position */
#define NMIC_IAR_NMI7_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI7_Pos)                 /* (NMIC_IAR) Active Interrupt 7 Mask */
#define NMIC_IAR_NMI7(value)                  (NMIC_IAR_NMI7_Msk & (_UINT32_(value) << NMIC_IAR_NMI7_Pos)) /* Assigment of value for NMI7 in the NMIC_IAR register */
#define NMIC_IAR_NMI8_Pos                     _UINT32_(8)                                          /* (NMIC_IAR) Active Interrupt 8 Position */
#define NMIC_IAR_NMI8_Msk                     (_UINT32_(0x1) << NMIC_IAR_NMI8_Pos)                 /* (NMIC_IAR) Active Interrupt 8 Mask */
#define NMIC_IAR_NMI8(value)                  (NMIC_IAR_NMI8_Msk & (_UINT32_(value) << NMIC_IAR_NMI8_Pos)) /* Assigment of value for NMI8 in the NMIC_IAR register */
#define NMIC_IAR_Msk                          _UINT32_(0x000001FF)                                 /* (NMIC_IAR) Register Mask  */

#define NMIC_IAR_NMI_Pos                      _UINT32_(0)                                          /* (NMIC_IAR Position) Active Interrupt 8 */
#define NMIC_IAR_NMI_Msk                      (_UINT32_(0x1FF) << NMIC_IAR_NMI_Pos)                /* (NMIC_IAR Mask) NMI */
#define NMIC_IAR_NMI(value)                   (NMIC_IAR_NMI_Msk & (_UINT32_(value) << NMIC_IAR_NMI_Pos)) 

