Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/nmic.h
/* -------- NMIC_ISR : (NMIC Offset: 0x0C) ( R/ 32) Interrupt Status Register -------- */
#define NMIC_ISR_NMI0_Pos                     _UINT32_(0)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 0 Pending (cleared on read) Position */
#define NMIC_ISR_NMI0_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI0_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 0 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI0(value)                  (NMIC_ISR_NMI0_Msk & (_UINT32_(value) << NMIC_ISR_NMI0_Pos)) /* Assigment of value for NMI0 in the NMIC_ISR register */
#define NMIC_ISR_NMI1_Pos                     _UINT32_(1)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 1 Pending (cleared on read) Position */
#define NMIC_ISR_NMI1_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI1_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 1 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI1(value)                  (NMIC_ISR_NMI1_Msk & (_UINT32_(value) << NMIC_ISR_NMI1_Pos)) /* Assigment of value for NMI1 in the NMIC_ISR register */
#define NMIC_ISR_NMI2_Pos                     _UINT32_(2)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 2 Pending (cleared on read) Position */
#define NMIC_ISR_NMI2_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI2_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 2 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI2(value)                  (NMIC_ISR_NMI2_Msk & (_UINT32_(value) << NMIC_ISR_NMI2_Pos)) /* Assigment of value for NMI2 in the NMIC_ISR register */
#define NMIC_ISR_NMI3_Pos                     _UINT32_(3)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 3 Pending (cleared on read) Position */
#define NMIC_ISR_NMI3_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI3_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 3 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI3(value)                  (NMIC_ISR_NMI3_Msk & (_UINT32_(value) << NMIC_ISR_NMI3_Pos)) /* Assigment of value for NMI3 in the NMIC_ISR register */
#define NMIC_ISR_NMI4_Pos                     _UINT32_(4)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 4 Pending (cleared on read) Position */
#define NMIC_ISR_NMI4_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI4_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 4 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI4(value)                  (NMIC_ISR_NMI4_Msk & (_UINT32_(value) << NMIC_ISR_NMI4_Pos)) /* Assigment of value for NMI4 in the NMIC_ISR register */
#define NMIC_ISR_NMI5_Pos                     _UINT32_(5)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 5 Pending (cleared on read) Position */
#define NMIC_ISR_NMI5_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI5_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 5 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI5(value)                  (NMIC_ISR_NMI5_Msk & (_UINT32_(value) << NMIC_ISR_NMI5_Pos)) /* Assigment of value for NMI5 in the NMIC_ISR register */
#define NMIC_ISR_NMI6_Pos                     _UINT32_(6)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 6 Pending (cleared on read) Position */
#define NMIC_ISR_NMI6_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI6_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 6 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI6(value)                  (NMIC_ISR_NMI6_Msk & (_UINT32_(value) << NMIC_ISR_NMI6_Pos)) /* Assigment of value for NMI6 in the NMIC_ISR register */
#define NMIC_ISR_NMI7_Pos                     _UINT32_(7)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 7 Pending (cleared on read) Position */
#define NMIC_ISR_NMI7_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI7_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 7 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI7(value)                  (NMIC_ISR_NMI7_Msk & (_UINT32_(value) << NMIC_ISR_NMI7_Pos)) /* Assigment of value for NMI7 in the NMIC_ISR register */
#define NMIC_ISR_NMI8_Pos                     _UINT32_(8)                                          /* (NMIC_ISR) Non-maskable Interrupt Source 8 Pending (cleared on read) Position */
#define NMIC_ISR_NMI8_Msk                     (_UINT32_(0x1) << NMIC_ISR_NMI8_Pos)                 /* (NMIC_ISR) Non-maskable Interrupt Source 8 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI8(value)                  (NMIC_ISR_NMI8_Msk & (_UINT32_(value) << NMIC_ISR_NMI8_Pos)) /* Assigment of value for NMI8 in the NMIC_ISR register */
#define NMIC_ISR_Msk                          _UINT32_(0x000001FF)                                 /* (NMIC_ISR) Register Mask  */

#define NMIC_ISR_NMI_Pos                      _UINT32_(0)                                          /* (NMIC_ISR Position) Non-maskable Interrupt Source 8 Pending (cleared on read) */
#define NMIC_ISR_NMI_Msk                      (_UINT32_(0x1FF) << NMIC_ISR_NMI_Pos)                /* (NMIC_ISR Mask) NMI */
#define NMIC_ISR_NMI(value)                   (NMIC_ISR_NMI_Msk & (_UINT32_(value) << NMIC_ISR_NMI_Pos)) 

/* -------- NMIC_GFCS : (NMIC Offset: 0x10) ( R/ 32) Glitch Filter Configuration Status Register -------- */
#define NMIC_GFCS_RDY0_Pos                    _UINT32_(0)                                          /* (NMIC_GFCS) Filter 0 Configuration Ready Position */
#define NMIC_GFCS_RDY0_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY0_Pos)                /* (NMIC_GFCS) Filter 0 Configuration Ready Mask */
#define NMIC_GFCS_RDY0(value)                 (NMIC_GFCS_RDY0_Msk & (_UINT32_(value) << NMIC_GFCS_RDY0_Pos)) /* Assigment of value for RDY0 in the NMIC_GFCS register */
#define NMIC_GFCS_RDY1_Pos                    _UINT32_(1)                                          /* (NMIC_GFCS) Filter 1 Configuration Ready Position */
#define NMIC_GFCS_RDY1_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY1_Pos)                /* (NMIC_GFCS) Filter 1 Configuration Ready Mask */
#define NMIC_GFCS_RDY1(value)                 (NMIC_GFCS_RDY1_Msk & (_UINT32_(value) << NMIC_GFCS_RDY1_Pos)) /* Assigment of value for RDY1 in the NMIC_GFCS register */
#define NMIC_GFCS_RDY2_Pos                    _UINT32_(2)                                          /* (NMIC_GFCS) Filter 2 Configuration Ready Position */
#define NMIC_GFCS_RDY2_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY2_Pos)                /* (NMIC_GFCS) Filter 2 Configuration Ready Mask */
#define NMIC_GFCS_RDY2(value)                 (NMIC_GFCS_RDY2_Msk & (_UINT32_(value) << NMIC_GFCS_RDY2_Pos)) /* Assigment of value for RDY2 in the NMIC_GFCS register */
#define NMIC_GFCS_RDY3_Pos                    _UINT32_(3)                                          /* (NMIC_GFCS) Filter 3 Configuration Ready Position */
#define NMIC_GFCS_RDY3_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY3_Pos)                /* (NMIC_GFCS) Filter 3 Configuration Ready Mask */
#define NMIC_GFCS_RDY3(value)                 (NMIC_GFCS_RDY3_Msk & (_UINT32_(value) << NMIC_GFCS_RDY3_Pos)) /* Assigment of value for RDY3 in the NMIC_GFCS register */
#define NMIC_GFCS_RDY4_Pos                    _UINT32_(4)                                          /* (NMIC_GFCS) Filter 4 Configuration Ready Position */
#define NMIC_GFCS_RDY4_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY4_Pos)                /* (NMIC_GFCS) Filter 4 Configuration Ready Mask */
#define NMIC_GFCS_RDY4(value)                 (NMIC_GFCS_RDY4_Msk & (_UINT32_(value) << NMIC_GFCS_RDY4_Pos)) /* Assigment of value for RDY4 in the NMIC_GFCS register */
#define NMIC_GFCS_RDY5_Pos                    _UINT32_(5)                                          /* (NMIC_GFCS) Filter 5 Configuration Ready Position */
#define NMIC_GFCS_RDY5_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY5_Pos)                /* (NMIC_GFCS) Filter 5 Configuration Ready Mask */
#define NMIC_GFCS_RDY5(value)                 (NMIC_GFCS_RDY5_Msk & (_UINT32_(value) << NMIC_GFCS_RDY5_Pos)) /* Assigment of value for RDY5 in the NMIC_GFCS register */
#define NMIC_GFCS_RDY6_Pos                    _UINT32_(6)                                          /* (NMIC_GFCS) Filter 6 Configuration Ready Position */
#define NMIC_GFCS_RDY6_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY6_Pos)                /* (NMIC_GFCS) Filter 6 Configuration Ready Mask */
#define NMIC_GFCS_RDY6(value)                 (NMIC_GFCS_RDY6_Msk & (_UINT32_(value) << NMIC_GFCS_RDY6_Pos)) /* Assigment of value for RDY6 in the NMIC_GFCS register */
#define NMIC_GFCS_RDY7_Pos                    _UINT32_(7)                                          /* (NMIC_GFCS) Filter 7 Configuration Ready Position */
#define NMIC_GFCS_RDY7_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY7_Pos)                /* (NMIC_GFCS) Filter 7 Configuration Ready Mask */
#define NMIC_GFCS_RDY7(value)                 (NMIC_GFCS_RDY7_Msk & (_UINT32_(value) << NMIC_GFCS_RDY7_Pos)) /* Assigment of value for RDY7 in the NMIC_GFCS register */
#define NMIC_GFCS_RDY8_Pos                    _UINT32_(8)                                          /* (NMIC_GFCS) Filter 8 Configuration Ready Position */
#define NMIC_GFCS_RDY8_Msk                    (_UINT32_(0x1) << NMIC_GFCS_RDY8_Pos)                /* (NMIC_GFCS) Filter 8 Configuration Ready Mask */
#define NMIC_GFCS_RDY8(value)                 (NMIC_GFCS_RDY8_Msk & (_UINT32_(value) << NMIC_GFCS_RDY8_Pos)) /* Assigment of value for RDY8 in the NMIC_GFCS register */
#define NMIC_GFCS_Msk                         _UINT32_(0x000001FF)                                 /* (NMIC_GFCS) Register Mask  */

#define NMIC_GFCS_RDY_Pos                     _UINT32_(0)                                          /* (NMIC_GFCS Position) Filter 8 Configuration Ready */
#define NMIC_GFCS_RDY_Msk                     (_UINT32_(0x1FF) << NMIC_GFCS_RDY_Pos)               /* (NMIC_GFCS Mask) RDY */
#define NMIC_GFCS_RDY(value)                  (NMIC_GFCS_RDY_Msk & (_UINT32_(value) << NMIC_GFCS_RDY_Pos)) 

/* -------- NMIC_SCFG0R : (NMIC Offset: 0x14) (R/W 32) Source Configuration Register 0 -------- */
#define NMIC_SCFG0R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG0R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG0R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG0R_GFSEL_Pos)             /* (NMIC_SCFG0R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG0R_GFSEL(value)              (NMIC_SCFG0R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG0R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG0R register */
#define NMIC_SCFG0R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG0R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG0R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG0R_GFEN_Pos)              /* (NMIC_SCFG0R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG0R_GFEN(value)               (NMIC_SCFG0R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG0R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG0R register */
#define NMIC_SCFG0R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG0R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG0R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG0R_POL_Pos)               /* (NMIC_SCFG0R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG0R_POL(value)                (NMIC_SCFG0R_POL_Msk & (_UINT32_(value) << NMIC_SCFG0R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG0R register */
#define NMIC_SCFG0R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG0R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG0R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG0R_LVL_Pos)               /* (NMIC_SCFG0R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG0R_LVL(value)                (NMIC_SCFG0R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG0R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG0R register */
#define NMIC_SCFG0R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG0R) Source Enable Position */
#define NMIC_SCFG0R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG0R_EN_Pos)                /* (NMIC_SCFG0R) Source Enable Mask */
#define NMIC_SCFG0R_EN(value)                 (NMIC_SCFG0R_EN_Msk & (_UINT32_(value) << NMIC_SCFG0R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG0R register */
#define NMIC_SCFG0R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG0R) Interrupt Line Freeze Position */
#define NMIC_SCFG0R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG0R_FRZ_Pos)               /* (NMIC_SCFG0R) Interrupt Line Freeze Mask */
#define NMIC_SCFG0R_FRZ(value)                (NMIC_SCFG0R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG0R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG0R register */
#define NMIC_SCFG0R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG0R) Register Mask  */


/* -------- NMIC_SCFG1R : (NMIC Offset: 0x18) (R/W 32) Source Configuration Register 1 -------- */
#define NMIC_SCFG1R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG1R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG1R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG1R_GFSEL_Pos)             /* (NMIC_SCFG1R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG1R_GFSEL(value)              (NMIC_SCFG1R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG1R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG1R register */
#define NMIC_SCFG1R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG1R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG1R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG1R_GFEN_Pos)              /* (NMIC_SCFG1R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG1R_GFEN(value)               (NMIC_SCFG1R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG1R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG1R register */
#define NMIC_SCFG1R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG1R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG1R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG1R_POL_Pos)               /* (NMIC_SCFG1R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG1R_POL(value)                (NMIC_SCFG1R_POL_Msk & (_UINT32_(value) << NMIC_SCFG1R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG1R register */
#define NMIC_SCFG1R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG1R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG1R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG1R_LVL_Pos)               /* (NMIC_SCFG1R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG1R_LVL(value)                (NMIC_SCFG1R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG1R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG1R register */
#define NMIC_SCFG1R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG1R) Source Enable Position */
#define NMIC_SCFG1R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG1R_EN_Pos)                /* (NMIC_SCFG1R) Source Enable Mask */
#define NMIC_SCFG1R_EN(value)                 (NMIC_SCFG1R_EN_Msk & (_UINT32_(value) << NMIC_SCFG1R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG1R register */
#define NMIC_SCFG1R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG1R) Interrupt Line Freeze Position */
#define NMIC_SCFG1R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG1R_FRZ_Pos)               /* (NMIC_SCFG1R) Interrupt Line Freeze Mask */
#define NMIC_SCFG1R_FRZ(value)                (NMIC_SCFG1R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG1R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG1R register */
#define NMIC_SCFG1R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG1R) Register Mask  */


/* -------- NMIC_SCFG2R : (NMIC Offset: 0x1C) (R/W 32) Source Configuration Register 2 -------- */
#define NMIC_SCFG2R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG2R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG2R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG2R_GFSEL_Pos)             /* (NMIC_SCFG2R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG2R_GFSEL(value)              (NMIC_SCFG2R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG2R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG2R register */
#define NMIC_SCFG2R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG2R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG2R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG2R_GFEN_Pos)              /* (NMIC_SCFG2R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG2R_GFEN(value)               (NMIC_SCFG2R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG2R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG2R register */
#define NMIC_SCFG2R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG2R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG2R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG2R_POL_Pos)               /* (NMIC_SCFG2R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG2R_POL(value)                (NMIC_SCFG2R_POL_Msk & (_UINT32_(value) << NMIC_SCFG2R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG2R register */
#define NMIC_SCFG2R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG2R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG2R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG2R_LVL_Pos)               /* (NMIC_SCFG2R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG2R_LVL(value)                (NMIC_SCFG2R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG2R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG2R register */
#define NMIC_SCFG2R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG2R) Source Enable Position */
#define NMIC_SCFG2R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG2R_EN_Pos)                /* (NMIC_SCFG2R) Source Enable Mask */
#define NMIC_SCFG2R_EN(value)                 (NMIC_SCFG2R_EN_Msk & (_UINT32_(value) << NMIC_SCFG2R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG2R register */
#define NMIC_SCFG2R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG2R) Interrupt Line Freeze Position */
#define NMIC_SCFG2R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG2R_FRZ_Pos)               /* (NMIC_SCFG2R) Interrupt Line Freeze Mask */
#define NMIC_SCFG2R_FRZ(value)                (NMIC_SCFG2R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG2R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG2R register */
#define NMIC_SCFG2R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG2R) Register Mask  */


/* -------- NMIC_SCFG3R : (NMIC Offset: 0x20) (R/W 32) Source Configuration Register 3 -------- */
#define NMIC_SCFG3R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG3R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG3R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG3R_GFSEL_Pos)             /* (NMIC_SCFG3R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG3R_GFSEL(value)              (NMIC_SCFG3R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG3R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG3R register */
#define NMIC_SCFG3R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG3R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG3R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG3R_GFEN_Pos)              /* (NMIC_SCFG3R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG3R_GFEN(value)               (NMIC_SCFG3R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG3R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG3R register */
#define NMIC_SCFG3R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG3R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG3R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG3R_POL_Pos)               /* (NMIC_SCFG3R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG3R_POL(value)                (NMIC_SCFG3R_POL_Msk & (_UINT32_(value) << NMIC_SCFG3R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG3R register */
#define NMIC_SCFG3R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG3R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG3R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG3R_LVL_Pos)               /* (NMIC_SCFG3R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG3R_LVL(value)                (NMIC_SCFG3R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG3R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG3R register */
#define NMIC_SCFG3R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG3R) Source Enable Position */
#define NMIC_SCFG3R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG3R_EN_Pos)                /* (NMIC_SCFG3R) Source Enable Mask */
#define NMIC_SCFG3R_EN(value)                 (NMIC_SCFG3R_EN_Msk & (_UINT32_(value) << NMIC_SCFG3R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG3R register */
#define NMIC_SCFG3R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG3R) Interrupt Line Freeze Position */
#define NMIC_SCFG3R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG3R_FRZ_Pos)               /* (NMIC_SCFG3R) Interrupt Line Freeze Mask */
#define NMIC_SCFG3R_FRZ(value)                (NMIC_SCFG3R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG3R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG3R register */
#define NMIC_SCFG3R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG3R) Register Mask  */


