Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/nmic.h
/* -------- NMIC_SCFG4R : (NMIC Offset: 0x24) (R/W 32) Source Configuration Register 4 -------- */
#define NMIC_SCFG4R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG4R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG4R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG4R_GFSEL_Pos)             /* (NMIC_SCFG4R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG4R_GFSEL(value)              (NMIC_SCFG4R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG4R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG4R register */
#define NMIC_SCFG4R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG4R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG4R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG4R_GFEN_Pos)              /* (NMIC_SCFG4R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG4R_GFEN(value)               (NMIC_SCFG4R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG4R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG4R register */
#define NMIC_SCFG4R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG4R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG4R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG4R_POL_Pos)               /* (NMIC_SCFG4R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG4R_POL(value)                (NMIC_SCFG4R_POL_Msk & (_UINT32_(value) << NMIC_SCFG4R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG4R register */
#define NMIC_SCFG4R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG4R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG4R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG4R_LVL_Pos)               /* (NMIC_SCFG4R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG4R_LVL(value)                (NMIC_SCFG4R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG4R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG4R register */
#define NMIC_SCFG4R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG4R) Source Enable Position */
#define NMIC_SCFG4R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG4R_EN_Pos)                /* (NMIC_SCFG4R) Source Enable Mask */
#define NMIC_SCFG4R_EN(value)                 (NMIC_SCFG4R_EN_Msk & (_UINT32_(value) << NMIC_SCFG4R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG4R register */
#define NMIC_SCFG4R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG4R) Interrupt Line Freeze Position */
#define NMIC_SCFG4R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG4R_FRZ_Pos)               /* (NMIC_SCFG4R) Interrupt Line Freeze Mask */
#define NMIC_SCFG4R_FRZ(value)                (NMIC_SCFG4R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG4R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG4R register */
#define NMIC_SCFG4R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG4R) Register Mask  */


/* -------- NMIC_SCFG5R : (NMIC Offset: 0x28) (R/W 32) Source Configuration Register 5 -------- */
#define NMIC_SCFG5R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG5R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG5R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG5R_GFSEL_Pos)             /* (NMIC_SCFG5R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG5R_GFSEL(value)              (NMIC_SCFG5R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG5R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG5R register */
#define NMIC_SCFG5R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG5R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG5R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG5R_GFEN_Pos)              /* (NMIC_SCFG5R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG5R_GFEN(value)               (NMIC_SCFG5R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG5R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG5R register */
#define NMIC_SCFG5R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG5R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG5R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG5R_POL_Pos)               /* (NMIC_SCFG5R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG5R_POL(value)                (NMIC_SCFG5R_POL_Msk & (_UINT32_(value) << NMIC_SCFG5R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG5R register */
#define NMIC_SCFG5R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG5R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG5R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG5R_LVL_Pos)               /* (NMIC_SCFG5R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG5R_LVL(value)                (NMIC_SCFG5R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG5R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG5R register */
#define NMIC_SCFG5R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG5R) Source Enable Position */
#define NMIC_SCFG5R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG5R_EN_Pos)                /* (NMIC_SCFG5R) Source Enable Mask */
#define NMIC_SCFG5R_EN(value)                 (NMIC_SCFG5R_EN_Msk & (_UINT32_(value) << NMIC_SCFG5R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG5R register */
#define NMIC_SCFG5R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG5R) Interrupt Line Freeze Position */
#define NMIC_SCFG5R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG5R_FRZ_Pos)               /* (NMIC_SCFG5R) Interrupt Line Freeze Mask */
#define NMIC_SCFG5R_FRZ(value)                (NMIC_SCFG5R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG5R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG5R register */
#define NMIC_SCFG5R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG5R) Register Mask  */


/* -------- NMIC_SCFG6R : (NMIC Offset: 0x2C) (R/W 32) Source Configuration Register 6 -------- */
#define NMIC_SCFG6R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG6R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG6R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG6R_GFSEL_Pos)             /* (NMIC_SCFG6R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG6R_GFSEL(value)              (NMIC_SCFG6R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG6R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG6R register */
#define NMIC_SCFG6R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG6R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG6R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG6R_GFEN_Pos)              /* (NMIC_SCFG6R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG6R_GFEN(value)               (NMIC_SCFG6R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG6R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG6R register */
#define NMIC_SCFG6R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG6R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG6R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG6R_POL_Pos)               /* (NMIC_SCFG6R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG6R_POL(value)                (NMIC_SCFG6R_POL_Msk & (_UINT32_(value) << NMIC_SCFG6R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG6R register */
#define NMIC_SCFG6R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG6R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG6R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG6R_LVL_Pos)               /* (NMIC_SCFG6R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG6R_LVL(value)                (NMIC_SCFG6R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG6R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG6R register */
#define NMIC_SCFG6R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG6R) Source Enable Position */
#define NMIC_SCFG6R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG6R_EN_Pos)                /* (NMIC_SCFG6R) Source Enable Mask */
#define NMIC_SCFG6R_EN(value)                 (NMIC_SCFG6R_EN_Msk & (_UINT32_(value) << NMIC_SCFG6R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG6R register */
#define NMIC_SCFG6R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG6R) Interrupt Line Freeze Position */
#define NMIC_SCFG6R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG6R_FRZ_Pos)               /* (NMIC_SCFG6R) Interrupt Line Freeze Mask */
#define NMIC_SCFG6R_FRZ(value)                (NMIC_SCFG6R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG6R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG6R register */
#define NMIC_SCFG6R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG6R) Register Mask  */


/* -------- NMIC_SCFG7R : (NMIC Offset: 0x30) (R/W 32) Source Configuration Register 7 -------- */
#define NMIC_SCFG7R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG7R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG7R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG7R_GFSEL_Pos)             /* (NMIC_SCFG7R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG7R_GFSEL(value)              (NMIC_SCFG7R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG7R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG7R register */
#define NMIC_SCFG7R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG7R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG7R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG7R_GFEN_Pos)              /* (NMIC_SCFG7R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG7R_GFEN(value)               (NMIC_SCFG7R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG7R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG7R register */
#define NMIC_SCFG7R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG7R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG7R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG7R_POL_Pos)               /* (NMIC_SCFG7R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG7R_POL(value)                (NMIC_SCFG7R_POL_Msk & (_UINT32_(value) << NMIC_SCFG7R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG7R register */
#define NMIC_SCFG7R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG7R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG7R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG7R_LVL_Pos)               /* (NMIC_SCFG7R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG7R_LVL(value)                (NMIC_SCFG7R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG7R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG7R register */
#define NMIC_SCFG7R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG7R) Source Enable Position */
#define NMIC_SCFG7R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG7R_EN_Pos)                /* (NMIC_SCFG7R) Source Enable Mask */
#define NMIC_SCFG7R_EN(value)                 (NMIC_SCFG7R_EN_Msk & (_UINT32_(value) << NMIC_SCFG7R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG7R register */
#define NMIC_SCFG7R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG7R) Interrupt Line Freeze Position */
#define NMIC_SCFG7R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG7R_FRZ_Pos)               /* (NMIC_SCFG7R) Interrupt Line Freeze Mask */
#define NMIC_SCFG7R_FRZ(value)                (NMIC_SCFG7R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG7R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG7R register */
#define NMIC_SCFG7R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG7R) Register Mask  */


/* -------- NMIC_SCFG8R : (NMIC Offset: 0x34) (R/W 32) Source Configuration Register 8 -------- */
#define NMIC_SCFG8R_GFSEL_Pos                 _UINT32_(0)                                          /* (NMIC_SCFG8R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG8R_GFSEL_Msk                 (_UINT32_(0x3) << NMIC_SCFG8R_GFSEL_Pos)             /* (NMIC_SCFG8R) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG8R_GFSEL(value)              (NMIC_SCFG8R_GFSEL_Msk & (_UINT32_(value) << NMIC_SCFG8R_GFSEL_Pos)) /* Assigment of value for GFSEL in the NMIC_SCFG8R register */
#define NMIC_SCFG8R_GFEN_Pos                  _UINT32_(4)                                          /* (NMIC_SCFG8R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG8R_GFEN_Msk                  (_UINT32_(0x1) << NMIC_SCFG8R_GFEN_Pos)              /* (NMIC_SCFG8R) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG8R_GFEN(value)               (NMIC_SCFG8R_GFEN_Msk & (_UINT32_(value) << NMIC_SCFG8R_GFEN_Pos)) /* Assigment of value for GFEN in the NMIC_SCFG8R register */
#define NMIC_SCFG8R_POL_Pos                   _UINT32_(8)                                          /* (NMIC_SCFG8R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG8R_POL_Msk                   (_UINT32_(0x1) << NMIC_SCFG8R_POL_Pos)               /* (NMIC_SCFG8R) Polarity (POL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG8R_POL(value)                (NMIC_SCFG8R_POL_Msk & (_UINT32_(value) << NMIC_SCFG8R_POL_Pos)) /* Assigment of value for POL in the NMIC_SCFG8R register */
#define NMIC_SCFG8R_LVL_Pos                   _UINT32_(9)                                          /* (NMIC_SCFG8R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Position */
#define NMIC_SCFG8R_LVL_Msk                   (_UINT32_(0x1) << NMIC_SCFG8R_LVL_Pos)               /* (NMIC_SCFG8R) Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8) Mask */
#define NMIC_SCFG8R_LVL(value)                (NMIC_SCFG8R_LVL_Msk & (_UINT32_(value) << NMIC_SCFG8R_LVL_Pos)) /* Assigment of value for LVL in the NMIC_SCFG8R register */
#define NMIC_SCFG8R_EN_Pos                    _UINT32_(16)                                         /* (NMIC_SCFG8R) Source Enable Position */
#define NMIC_SCFG8R_EN_Msk                    (_UINT32_(0x1) << NMIC_SCFG8R_EN_Pos)                /* (NMIC_SCFG8R) Source Enable Mask */
#define NMIC_SCFG8R_EN(value)                 (NMIC_SCFG8R_EN_Msk & (_UINT32_(value) << NMIC_SCFG8R_EN_Pos)) /* Assigment of value for EN in the NMIC_SCFG8R register */
#define NMIC_SCFG8R_FRZ_Pos                   _UINT32_(31)                                         /* (NMIC_SCFG8R) Interrupt Line Freeze Position */
#define NMIC_SCFG8R_FRZ_Msk                   (_UINT32_(0x1) << NMIC_SCFG8R_FRZ_Pos)               /* (NMIC_SCFG8R) Interrupt Line Freeze Mask */
#define NMIC_SCFG8R_FRZ(value)                (NMIC_SCFG8R_FRZ_Msk & (_UINT32_(value) << NMIC_SCFG8R_FRZ_Pos)) /* Assigment of value for FRZ in the NMIC_SCFG8R register */
#define NMIC_SCFG8R_Msk                       _UINT32_(0x80010313)                                 /* (NMIC_SCFG8R) Register Mask  */


/* -------- NMIC_WPMR : (NMIC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define NMIC_WPMR_WPCFEN_Pos                  _UINT32_(0)                                          /* (NMIC_WPMR) Write Protection Configuration Enable Position */
#define NMIC_WPMR_WPCFEN_Msk                  (_UINT32_(0x1) << NMIC_WPMR_WPCFEN_Pos)              /* (NMIC_WPMR) Write Protection Configuration Enable Mask */
#define NMIC_WPMR_WPCFEN(value)               (NMIC_WPMR_WPCFEN_Msk & (_UINT32_(value) << NMIC_WPMR_WPCFEN_Pos)) /* Assigment of value for WPCFEN in the NMIC_WPMR register */
#define NMIC_WPMR_WPITEN_Pos                  _UINT32_(1)                                          /* (NMIC_WPMR) Write Protection Interrupt Enable Position */
#define NMIC_WPMR_WPITEN_Msk                  (_UINT32_(0x1) << NMIC_WPMR_WPITEN_Pos)              /* (NMIC_WPMR) Write Protection Interrupt Enable Mask */
#define NMIC_WPMR_WPITEN(value)               (NMIC_WPMR_WPITEN_Msk & (_UINT32_(value) << NMIC_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the NMIC_WPMR register */
#define NMIC_WPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (NMIC_WPMR) Write Protection Key Position */
#define NMIC_WPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << NMIC_WPMR_WPKEY_Pos)          /* (NMIC_WPMR) Write Protection Key Mask */
#define NMIC_WPMR_WPKEY(value)                (NMIC_WPMR_WPKEY_Msk & (_UINT32_(value) << NMIC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the NMIC_WPMR register */
#define   NMIC_WPMR_WPKEY_PASSWD_Val          _UINT32_(0x4E4D49)                                   /* (NMIC_WPMR) Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0.  */
#define NMIC_WPMR_WPKEY_PASSWD                (NMIC_WPMR_WPKEY_PASSWD_Val << NMIC_WPMR_WPKEY_Pos)  /* (NMIC_WPMR) Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0. Position  */
#define NMIC_WPMR_Msk                         _UINT32_(0xFFFFFF03)                                 /* (NMIC_WPMR) Register Mask  */


/* -------- NMIC_WPSR : (NMIC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define NMIC_WPSR_WPVS_Pos                    _UINT32_(0)                                          /* (NMIC_WPSR) Write Protection Register Violation Status Position */
#define NMIC_WPSR_WPVS_Msk                    (_UINT32_(0x1) << NMIC_WPSR_WPVS_Pos)                /* (NMIC_WPSR) Write Protection Register Violation Status Mask */
#define NMIC_WPSR_WPVS(value)                 (NMIC_WPSR_WPVS_Msk & (_UINT32_(value) << NMIC_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the NMIC_WPSR register */
#define NMIC_WPSR_FZWVS_Pos                   _UINT32_(1)                                          /* (NMIC_WPSR) Frozen Register Write Violation Status Position */
#define NMIC_WPSR_FZWVS_Msk                   (_UINT32_(0x1) << NMIC_WPSR_FZWVS_Pos)               /* (NMIC_WPSR) Frozen Register Write Violation Status Mask */
#define NMIC_WPSR_FZWVS(value)                (NMIC_WPSR_FZWVS_Msk & (_UINT32_(value) << NMIC_WPSR_FZWVS_Pos)) /* Assigment of value for FZWVS in the NMIC_WPSR register */
#define NMIC_WPSR_BSWVS_Pos                   _UINT32_(2)                                          /* (NMIC_WPSR) Busy Register Write Violation Status Position */
#define NMIC_WPSR_BSWVS_Msk                   (_UINT32_(0x1) << NMIC_WPSR_BSWVS_Pos)               /* (NMIC_WPSR) Busy Register Write Violation Status Mask */
#define NMIC_WPSR_BSWVS(value)                (NMIC_WPSR_BSWVS_Msk & (_UINT32_(value) << NMIC_WPSR_BSWVS_Pos)) /* Assigment of value for BSWVS in the NMIC_WPSR register */
#define NMIC_WPSR_WVSRC_Pos                   _UINT32_(8)                                          /* (NMIC_WPSR) Write Violation Source Position */
#define NMIC_WPSR_WVSRC_Msk                   (_UINT32_(0xFF) << NMIC_WPSR_WVSRC_Pos)              /* (NMIC_WPSR) Write Violation Source Mask */
#define NMIC_WPSR_WVSRC(value)                (NMIC_WPSR_WVSRC_Msk & (_UINT32_(value) << NMIC_WPSR_WVSRC_Pos)) /* Assigment of value for WVSRC in the NMIC_WPSR register */
#define NMIC_WPSR_Msk                         _UINT32_(0x0000FF07)                                 /* (NMIC_WPSR) Register Mask  */


