Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/nmic.h
/** \brief NMIC register offsets definitions */
#define NMIC_IER_REG_OFST              _UINT32_(0x00)      /* (NMIC_IER) Interrupt Enable Register Offset */
#define NMIC_IDR_REG_OFST              _UINT32_(0x04)      /* (NMIC_IDR) Interrupt Disable Register Offset */
#define NMIC_IAR_REG_OFST              _UINT32_(0x08)      /* (NMIC_IAR) Interrupt Active Register Offset */
#define NMIC_ISR_REG_OFST              _UINT32_(0x0C)      /* (NMIC_ISR) Interrupt Status Register Offset */
#define NMIC_GFCS_REG_OFST             _UINT32_(0x10)      /* (NMIC_GFCS) Glitch Filter Configuration Status Register Offset */
#define NMIC_SCFG0R_REG_OFST           _UINT32_(0x14)      /* (NMIC_SCFG0R) Source Configuration Register 0 Offset */
#define NMIC_SCFG1R_REG_OFST           _UINT32_(0x18)      /* (NMIC_SCFG1R) Source Configuration Register 1 Offset */
#define NMIC_SCFG2R_REG_OFST           _UINT32_(0x1C)      /* (NMIC_SCFG2R) Source Configuration Register 2 Offset */
#define NMIC_SCFG3R_REG_OFST           _UINT32_(0x20)      /* (NMIC_SCFG3R) Source Configuration Register 3 Offset */
#define NMIC_SCFG4R_REG_OFST           _UINT32_(0x24)      /* (NMIC_SCFG4R) Source Configuration Register 4 Offset */
#define NMIC_SCFG5R_REG_OFST           _UINT32_(0x28)      /* (NMIC_SCFG5R) Source Configuration Register 5 Offset */
#define NMIC_SCFG6R_REG_OFST           _UINT32_(0x2C)      /* (NMIC_SCFG6R) Source Configuration Register 6 Offset */
#define NMIC_SCFG7R_REG_OFST           _UINT32_(0x30)      /* (NMIC_SCFG7R) Source Configuration Register 7 Offset */
#define NMIC_SCFG8R_REG_OFST           _UINT32_(0x34)      /* (NMIC_SCFG8R) Source Configuration Register 8 Offset */
#define NMIC_WPMR_REG_OFST             _UINT32_(0xE4)      /* (NMIC_WPMR) Write Protection Mode Register Offset */
#define NMIC_WPSR_REG_OFST             _UINT32_(0xE8)      /* (NMIC_WPSR) Write Protection Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief NMIC register API structure */
typedef struct
{
  __O   uint32_t                       NMIC_IER;           /**< Offset: 0x00 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       NMIC_IDR;           /**< Offset: 0x04 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       NMIC_IAR;           /**< Offset: 0x08 (R/   32) Interrupt Active Register */
  __I   uint32_t                       NMIC_ISR;           /**< Offset: 0x0C (R/   32) Interrupt Status Register */
  __I   uint32_t                       NMIC_GFCS;          /**< Offset: 0x10 (R/   32) Glitch Filter Configuration Status Register */
  __IO  uint32_t                       NMIC_SCFG0R;        /**< Offset: 0x14 (R/W  32) Source Configuration Register 0 */
  __IO  uint32_t                       NMIC_SCFG1R;        /**< Offset: 0x18 (R/W  32) Source Configuration Register 1 */
  __IO  uint32_t                       NMIC_SCFG2R;        /**< Offset: 0x1C (R/W  32) Source Configuration Register 2 */
  __IO  uint32_t                       NMIC_SCFG3R;        /**< Offset: 0x20 (R/W  32) Source Configuration Register 3 */
  __IO  uint32_t                       NMIC_SCFG4R;        /**< Offset: 0x24 (R/W  32) Source Configuration Register 4 */
  __IO  uint32_t                       NMIC_SCFG5R;        /**< Offset: 0x28 (R/W  32) Source Configuration Register 5 */
  __IO  uint32_t                       NMIC_SCFG6R;        /**< Offset: 0x2C (R/W  32) Source Configuration Register 6 */
  __IO  uint32_t                       NMIC_SCFG7R;        /**< Offset: 0x30 (R/W  32) Source Configuration Register 7 */
  __IO  uint32_t                       NMIC_SCFG8R;        /**< Offset: 0x34 (R/W  32) Source Configuration Register 8 */
  __I   uint8_t                        Reserved1[0xAC];
  __IO  uint32_t                       NMIC_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       NMIC_WPSR;          /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} nmic_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH707_NMIC_COMPONENT_H_ */
